//!==============================================================
// Змінна num може набувати 4 значення: '1', '2', '3' або '4' 
// (запитуй це значення у користувача через prompt). 
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач 
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.

// const num = Number(prompt("введіть значення від 1 до 4"));
// let result = 0;
// switch (num){
//     case 1:
//         result = 'Зима';
//         break
//     case 2:
//         result = 'Весна';
//         break
//     case 3:
//         result = 'Літа';
//         break
//     case 4:
//         result = 'Осінь';
//         break
//     default:
//         result = "Вибачте, але ви маєте ввести значення від 1 до 4 включно";
// }
// console.log(result);
    


//!==============================================================
// Отримуйте від користувача число (кількість хвилин) через prompt
// і виводьте у консоль рядок у форматі годин та хвилин.
// Приклад: користувач вводить в prompt '70' -> в консолі відобразиться '01:10'.
// Корисне посилання для відображення годин та хвилин у потрібному форматі ('01' замість '1'): 
// https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/padStart#examples
// "abc".padStart(8, "0");




// const num = Number(prompt("введіть кількість хвилин"));
// const hours = String(Math.floor(num / 60)).padStart(2, "0");
// const min = String(num % 60).padStart(2, "0");
// console.log(`${hours}:${min}`);


//!==============================================================

// Використайте цикл while, щоб вивести в console всі числа від 0 до 20 включно.


// let i = 0;
// while(i<=20){
//     i++;
//     console.log(i);
    
// }

//!==============================================================
// Напишіть функцію getNumbers(min, max), що приймає 2 параметри - 
// мінімальне і максимальне число відповідно.
// Напишіть цикл всередині функції, який виводить у консоль
// всі числа від max до min за спаданням.
// Окрім цього, підрахуйте суму всіх парних чисел в цьому циклі
// і поверніть її з функції.


// function getNumbers(min, max){
//     let sum = 0;
//     for(let i = max; i >= min; i--){
//          console.log(i);
//          if (i % 2 === 0){
//             sum += i;
//          }
//     }
//     return sum;
// }

// console.log(getNumbers(5, 10));


//!==============================================================
// Напишіть функцію min(a, b), яка приймає 2 числа і повертає меньше з них.
// Потрібно додати перевірку, що функція отримує саме числа, в іншому випадку
// повертати з функції рядок - 'Not a number!'.

// function min(a, b){
//     if (typeof a !== "number" || typeof b !== "number"){
//         return 'Not a number!';
//     }
//     // if (a>b){
//     //     return b;
//     // } else {
//     //     return a;
//     // }

//     // return a > b ? b : a;

//     return Math.min(a,b);
// }

// console.log(min(10.5, 4));


//!==============================================================

// Напишіть функцію isAdult(age), яка  приймає число - вік користувача і повертає true, 
// якщо параметр age більше чи дорівнює 18.
// В іншому випадку вона запитує підтвердження через confirm 
// і повертає його результат (true/false).

// function isAdult(age){
//     return age >= 18 ? true : confirm("Вам є 18 років?");
// }
// console.log(isAdult());

//!==============================================================
// Напишіть функцію fizzBuzz(num), яка приймає число і перевіряє кожне число від 1 до num:
// Якщо число ділитися  без остачі на 3 - виводить в консоль 'fizz',
// якщо ділиться  без остачі на 5 - виводить в консоль 'buzz',
// якщо ділиться  без остачі і на 3, і на 5 - виводить в консоль 'fizzbuzz'.

// function fizzBuzz(num){
//     for(let i = 0; i <= num; i++){
//         console.log(i);
//         if (i % 3 === 0 && i % 5 === 0){
//             console.log('fizzbuzz');
//         } else if(i % 3 === 0) {
//             console.log('fizz');
//         } else if(i % 5 === 0) {
//             console.log('buzz');
//         }
//     }
// }

// fizzBuzz(30);

//!==============================================================
// 1. Напишіть цикл, який пропонує ввести
// число більше 100 через prompt.
// Якщо користувач ввів інше число - попросити
// ввести ще раз.
// Цикл повинен питати число, доки користувач не
// введе число більше 100, чи не натисне кнопку
// Cancel в prompt

// let temp;
// do {
//     temp = prompt("Введіть число більше 100");
// } while (temp <= 100 && temp !== null);
// console.log(temp);

//!==============================================================
// 2. Напишіть функцію, яка приймає адресу сайта url та перевіряє чи закінчується значення
// параметра символом /. Якщо ні, додайте до кінця
// значення url цей символ і поверніть оновлене значення з функції, але тільки в тому випадку,
// якщо в url є підрядок "my-site".
// В іншому випадку поверніть з функції адресу в незмінному вигляді


function editUrl(url){
    // console.log('123'.startsWith('1'));
    // console.log(url[url.length-1]);
    if (url.endsWith("/")){
        return url;
    } else if(url.includes("my-site")){
        // return url + "/";
        return `${url}/`;
    } else{
        return url;
    }
}

const url = "https://my-site.com/about";
console.log(editUrl(url));

